Feature: Изтриване на вино от базата данни

  Scenario: Успешно изтриване на вино по ID
    Given Потребителят търси по id на вино: 1
    When Потребителят натиска бутона изтрий
    Then Вижда съобщение: "Успешно изтрито вино от базата данни по идентификатор!"

  Scenario: Успешно изтриване на вино по име
    Given Потребителят търси по име на вино: "Bendida"
    When Потребителят натиска бутона изтрий
    Then Вижда съобщение: "Успешно изтрито вино от базата данни по име!"

  Scenario: Изтриване на несъществуващо вино по ID
    Given Потребителят търси по id на вино: 200
    When Потребителят натиска бутона изтрий
    Then Вижда съобщение: "Не съществува вино с такъв идентификатор, имате грешка"

  Scenario: Изтриване на несъществуващо вино по име
    Given Потребителят търси по име на вино: "Gosho"
    When Потребителят натиска бутона изтрий
    Then Вижда съобщение: "Не съществува вино с такова име, имате грешка"

  Scenario: Изтриване на вино без въведен идентификатор или име
    Given Потребителят не въвежда име и id на вино
    When Потребителят натиска бутона изтрий
    Then Вижда съобщение: "Моля въведете име или идентификатор на виното!"
