Feature: Добавяне на вино в базата данни

  Scenario: Успешно добавяне на вино
    Given Потребителят въвежда id на вино: 1
    Given Потребителят въвежда име на вино: "Bendida"
    Given Потребителят въвежда година на производство на вино: 2021
    Given Потребителят въвежда сорт на вино: "Wild Rubin"
    When Натиска бутона добави
    Then Вижда съобщение : "Успешно добавено вино в базата данни!"

  Scenario: Неуспешно добавяне на вино без име
    Given Потребителят въвежда id на вино: 1
    Given Потребителят въвежда година на производство на вино: 2021
    Given Потребителят въвежда сорт на вино: "Wild Rubin"
    When Натиска бутона добави
    Then Вижда съобщение : "Невалидни данни! Въведете име на вино"

  Scenario: Неуспешно добавяне на вино без година на производство
    Given Потребителят въвежда id на вино: 1
    Given Потребителят въвежда име на вино: "Bendida"
    Given Потребителят въвежда сорт на вино: "Wild Rubin"
    When Натиска бутона добави
    Then Вижда съобщение : "Невалидни данни! Въведете година на производство на вино"

  Scenario: Неуспешно добавяне на вино без сорт
    Given Потребителят въвежда id на вино: 1
    Given Потребителят въвежда име на вино: "Bendida"
    Given Потребителят въвежда година на производство на вино: 2021
    When Натиска бутона добави
    Then Вижда съобщение : "Невалидни данни! Въведете сорт на вино"

  Scenario: Неуспешно добавяне на вино с некоректна година
    Given Потребителят въвежда id на вино: 1
    Given Потребителят въвежда име на вино: "Bendida"
    Given Потребителят въвежда година на производство на вино: -1
    Given Потребителят въвежда сорт на вино: "Wild Rubin"
    When Натиска бутона добави
    Then Вижда съобщение : "Невалидни данни! Годината е в невалиден формат, моля опитайте отново"